//*************************************************************
//*** ΠΛΣ50 "Βασικές Εξειδικεύσεις σε Θεωρία και Λογισμικό" ***
//***                Εργασία Ε01 - Θέμα 1                   ***
//***                                                       ***
//***                   Ακ.έτος 2016-17                     ***
//***                Φοιτητής: Σεραφείμ Γκέκας              ***
//***                     AM: 123542                        ***
//*************************************************************

#include <stdio.h> /* Την χρειαζόμαστε για την printf(), scanf() και switch() */

int main()
{
 float a, b, c; /*μεταβλητές για τους δύο αριθμούς a,b και για το αποτέλεσμα c*/
 char o;        /*μεταβλητή για τον τελεστή πράξης*/

 printf("Give number operation number:\n");
 scanf("%f %c %f", &a, &o, &b); /*είσοδος από τον χρήστη των αριθμών και του τελεστή*/

 switch (o){                /*Ανάλογα με τον τύπο του τελεστή, αποθηκεύουμε την αντίστοιχη πράξη στο αποτέλεσμα c*/
 case '+': c=a+b; break;
 case '-': c=a-b; break;
 case '/': c=a/b; break;
 case '*': c=a*b; break;
 }

 printf("The result is: %1.3f\n", c); /*Τυπώνουμε στην οθόνη το αποτέλεσμα. Περιορίζω το κλασματικό μέρος στα τρία ψηφία εκτιμώντας πως δεν χρειάζεται
                                        μεγαλύτερη ακρίβεια*/

 return 0;
 }
