//*************************************************************
//*** ΠΛΣ50 "Βασικές Εξειδικεύσεις σε Θεωρία και Λογισμικό" ***
//***                Εργασία Ε01 - Θέμα 3                   ***
//***                                                       ***
//***                   Ακ.έτος 2016-17                     ***
//***                Φοιτητής: Σεραφείμ Γκέκας              ***
//***                     AM: 123542                        ***
//*************************************************************

#include <stdio.h> /*Την χρειαζόμαστε για την printf() και scanf()*/

int main()
{
    const int BASE = 2 ;/*Δηλώνουμε την σταθερή μας βάση*/
    int number; /*Σταθερά για τον δεκαδικό αριθμό*/

    printf("Please give positive decimal integer number:\n");
    scanf(" %d", &number); /*Ο χρήστης μας δίνει τον δεκαδικό αριθμό*/

    /*Έλεγχος θετικού αριθμού*/
    while (number<0){
        printf("You gave negative number. Please give a positive decimal integer number:\n");
        scanf(" %d", &number);} /*Το πρόγραμμα θα συνεχίσει μόνο εάν o χρήστης μας δώσει θετικό αριθμό*/

    while (number>0){
        number%BASE == 0 ? putchar('0'): putchar('1'); /*Εάν το υπόλοιπο της διαίρεσης με την βάση είναι 0 τυπώνουμε το 0 αλλιώς το 1*/
        number/=BASE;} /*Το πρόγραμμα τερματίζει όταν ο τρέχον αριθμός (number) είνα μηδέν*/

    return 0;
}
